testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_1____loss-rate-percent_0____clients-requests_10/1/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 75.68ms, 132.13 req/s, 126.06MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 666 sent, 8245 received
                     min         max         mean         sd        +/- sd
time for request:    45.10ms     64.50ms     56.09ms      6.82ms    60.00%
time for connect:     6.12ms     28.70ms     17.33ms      7.73ms    60.00%
time to 1st byte:    28.27ms     31.39ms     29.78ms      1.05ms    60.00%
req/s           :      13.34       14.14       13.61        0.25    70.00%